---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarPresentationMode.FirstLast
enum: Autodesk.Revit.DB.Structure.RebarPresentationMode
source: html/84cfa6b2-460d-9d32-1f6a-55dbbfece098.htm
---
# Autodesk.Revit.DB.Structure.RebarPresentationMode.FirstLast

The first and last bars are presented.